#### Dataset Location

In [3]:
# https://mitu.co.in/dataset
# Download -> student-info.csv, student-info1.csv, student-info2.csv
# Store them in current working directory

#### How to find current working directory?

In [5]:
pwd

'/home/mitu/cdac'

#### Import the dataset

In [7]:
import pandas as pd

In [8]:
df = pd.read_csv('student-info.csv')

In [9]:
df

    roll              name class  marks  age
0      1   Aditya Kulkarni    FY   85.5   15
1      2     Swapnil Joshi    FY   92.1   16
2      3  Aniket Deshpande    FY   78.3   16
3      4       Gauri Patil    FY   65.8   14
4      5      Rohan Sawant    FY   88.2   17
5      6        Pooja More    FY   72.9   13
6      7    Shreyas Shinde    FY   95.0   16
7      8      Sneha Jadhav    FY   58.6   14
8      9      Mahesh Pawar    FY   76.4   18
9     10      Priya Chavan    FY   89.7   15
10    11      Amruta Kadam    SY   91.2   13
11    12      Sandeep Mane    SY   68.5   17
12    13      Neha Gaikwad    SY   79.9   17
13    14       Sachin Kale    SY   83.1   15
14    15      Manisha Rane    SY   94.6   15
15    16      Prasad Desai    SY   61.3   14
16    17      Aditi Phadke    SY   77.8   16
17    18      Sameer Tambe    SY   82.0   18
18    19       Reshma Apte    SY   90.4   14
19    20     Kiran Godbole    SY   73.7   16
20    21    Archana Ingale    TY   55.1   13
21    22     Vivek Bhosale    TY   66.9   17
22    23     Sonali Kamble    TY   96.2   17
23    24    Harshal Shelar    TY   71.5   15
24    25   Prachi Deshmukh    TY   48.8   15
25    26      Milind Patil    TY   84.3   14
26    27     Rohini Sawant    TY   59.7   16
27    28   Yogesh Kulkarni    TY   93.0   18
28    29  Supriya Waghmare    TY   67.2   14
29    30      Girish Joshi    TY   75.6   13

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df.shape

(30, 5)

In [12]:
df.size

150

In [13]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [14]:
df.head()

   roll              name class  marks  age
0     1   Aditya Kulkarni    FY   85.5   15
1     2     Swapnil Joshi    FY   92.1   16
2     3  Aniket Deshpande    FY   78.3   16
3     4       Gauri Patil    FY   65.8   14
4     5      Rohan Sawant    FY   88.2   17

In [15]:
df.head(3)

   roll              name class  marks  age
0     1   Aditya Kulkarni    FY   85.5   15
1     2     Swapnil Joshi    FY   92.1   16
2     3  Aniket Deshpande    FY   78.3   16

In [16]:
df.tail()

    roll              name class  marks  age
25    26      Milind Patil    TY   84.3   14
26    27     Rohini Sawant    TY   59.7   16
27    28   Yogesh Kulkarni    TY   93.0   18
28    29  Supriya Waghmare    TY   67.2   14
29    30      Girish Joshi    TY   75.6   13

In [17]:
df.tail(2)

    roll              name class  marks  age
28    29  Supriya Waghmare    TY   67.2   14
29    30      Girish Joshi    TY   75.6   13

#### Slicing - Index Based

In [19]:
subdf = df.iloc[12:18,1:4]

In [20]:
subdf

            name class  marks
12  Neha Gaikwad    SY   79.9
13   Sachin Kale    SY   83.1
14  Manisha Rane    SY   94.6
15  Prasad Desai    SY   61.3
16  Aditi Phadke    SY   77.8
17  Sameer Tambe    SY   82.0

In [21]:
df.iloc[:18,1:]

                name class  marks  age
0    Aditya Kulkarni    FY   85.5   15
1      Swapnil Joshi    FY   92.1   16
2   Aniket Deshpande    FY   78.3   16
3        Gauri Patil    FY   65.8   14
4       Rohan Sawant    FY   88.2   17
5         Pooja More    FY   72.9   13
6     Shreyas Shinde    FY   95.0   16
7       Sneha Jadhav    FY   58.6   14
8       Mahesh Pawar    FY   76.4   18
9       Priya Chavan    FY   89.7   15
10      Amruta Kadam    SY   91.2   13
11      Sandeep Mane    SY   68.5   17
12      Neha Gaikwad    SY   79.9   17
13       Sachin Kale    SY   83.1   15
14      Manisha Rane    SY   94.6   15
15      Prasad Desai    SY   61.3   14
16      Aditi Phadke    SY   77.8   16
17      Sameer Tambe    SY   82.0   18

In [22]:
df.iloc[12:18,[0,1,3]]

    roll          name  marks
12    13  Neha Gaikwad   79.9
13    14   Sachin Kale   83.1
14    15  Manisha Rane   94.6
15    16  Prasad Desai   61.3
16    17  Aditi Phadke   77.8
17    18  Sameer Tambe   82.0

In [23]:
df.iloc[[4,11,21,24,7],[0,1,3]]

    roll             name  marks
4      5     Rohan Sawant   88.2
11    12     Sandeep Mane   68.5
21    22    Vivek Bhosale   66.9
24    25  Prachi Deshmukh   48.8
7      8     Sneha Jadhav   58.6

In [24]:
df.iloc[[4,11,21,24,7],:]

    roll             name class  marks  age
4      5     Rohan Sawant    FY   88.2   17
11    12     Sandeep Mane    SY   68.5   17
21    22    Vivek Bhosale    TY   66.9   17
24    25  Prachi Deshmukh    TY   48.8   15
7      8     Sneha Jadhav    FY   58.6   14

In [25]:
df.iloc[[4,11,21,24,7],]

    roll             name class  marks  age
4      5     Rohan Sawant    FY   88.2   17
11    12     Sandeep Mane    SY   68.5   17
21    22    Vivek Bhosale    TY   66.9   17
24    25  Prachi Deshmukh    TY   48.8   15
7      8     Sneha Jadhav    FY   58.6   14

#### Slicing - Label Based

In [28]:
df.loc[:,'name']

0      Aditya Kulkarni
1        Swapnil Joshi
2     Aniket Deshpande
3          Gauri Patil
4         Rohan Sawant
5           Pooja More
6       Shreyas Shinde
7         Sneha Jadhav
8         Mahesh Pawar
9         Priya Chavan
10        Amruta Kadam
11        Sandeep Mane
12        Neha Gaikwad
13         Sachin Kale
14        Manisha Rane
15        Prasad Desai
16        Aditi Phadke
17        Sameer Tambe
18         Reshma Apte
19       Kiran Godbole
20      Archana Ingale
21       Vivek Bhosale
22       Sonali Kamble
23      Harshal Shelar
24     Prachi Deshmukh
25        Milind Patil
26       Rohini Sawant
27     Yogesh Kulkarni
28    Supriya Waghmare
29        Girish Joshi
Name: name, dtype: object

In [29]:
df.loc[:,['name','marks']]

                name  marks
0    Aditya Kulkarni   85.5
1      Swapnil Joshi   92.1
2   Aniket Deshpande   78.3
3        Gauri Patil   65.8
4       Rohan Sawant   88.2
5         Pooja More   72.9
6     Shreyas Shinde   95.0
7       Sneha Jadhav   58.6
8       Mahesh Pawar   76.4
9       Priya Chavan   89.7
10      Amruta Kadam   91.2
11      Sandeep Mane   68.5
12      Neha Gaikwad   79.9
13       Sachin Kale   83.1
14      Manisha Rane   94.6
15      Prasad Desai   61.3
16      Aditi Phadke   77.8
17      Sameer Tambe   82.0
18       Reshma Apte   90.4
19     Kiran Godbole   73.7
20    Archana Ingale   55.1
21     Vivek Bhosale   66.9
22     Sonali Kamble   96.2
23    Harshal Shelar   71.5
24   Prachi Deshmukh   48.8
25      Milind Patil   84.3
26     Rohini Sawant   59.7
27   Yogesh Kulkarni   93.0
28  Supriya Waghmare   67.2
29      Girish Joshi   75.6

In [31]:
df['name']

0      Aditya Kulkarni
1        Swapnil Joshi
2     Aniket Deshpande
3          Gauri Patil
4         Rohan Sawant
5           Pooja More
6       Shreyas Shinde
7         Sneha Jadhav
8         Mahesh Pawar
9         Priya Chavan
10        Amruta Kadam
11        Sandeep Mane
12        Neha Gaikwad
13         Sachin Kale
14        Manisha Rane
15        Prasad Desai
16        Aditi Phadke
17        Sameer Tambe
18         Reshma Apte
19       Kiran Godbole
20      Archana Ingale
21       Vivek Bhosale
22       Sonali Kamble
23      Harshal Shelar
24     Prachi Deshmukh
25        Milind Patil
26       Rohini Sawant
27     Yogesh Kulkarni
28    Supriya Waghmare
29        Girish Joshi
Name: name, dtype: object

In [32]:
df[['name','marks','age']]

                name  marks  age
0    Aditya Kulkarni   85.5   15
1      Swapnil Joshi   92.1   16
2   Aniket Deshpande   78.3   16
3        Gauri Patil   65.8   14
4       Rohan Sawant   88.2   17
5         Pooja More   72.9   13
6     Shreyas Shinde   95.0   16
7       Sneha Jadhav   58.6   14
8       Mahesh Pawar   76.4   18
9       Priya Chavan   89.7   15
10      Amruta Kadam   91.2   13
11      Sandeep Mane   68.5   17
12      Neha Gaikwad   79.9   17
13       Sachin Kale   83.1   15
14      Manisha Rane   94.6   15
15      Prasad Desai   61.3   14
16      Aditi Phadke   77.8   16
17      Sameer Tambe   82.0   18
18       Reshma Apte   90.4   14
19     Kiran Godbole   73.7   16
20    Archana Ingale   55.1   13
21     Vivek Bhosale   66.9   17
22     Sonali Kamble   96.2   17
23    Harshal Shelar   71.5   15
24   Prachi Deshmukh   48.8   15
25      Milind Patil   84.3   14
26     Rohini Sawant   59.7   16
27   Yogesh Kulkarni   93.0   18
28  Supriya Waghmare   67.2   14
29      Girish Joshi   75.6   13

In [34]:
df.drop(4)

    roll              name class  marks  age
0      1   Aditya Kulkarni    FY   85.5   15
1      2     Swapnil Joshi    FY   92.1   16
2      3  Aniket Deshpande    FY   78.3   16
3      4       Gauri Patil    FY   65.8   14
5      6        Pooja More    FY   72.9   13
6      7    Shreyas Shinde    FY   95.0   16
7      8      Sneha Jadhav    FY   58.6   14
8      9      Mahesh Pawar    FY   76.4   18
9     10      Priya Chavan    FY   89.7   15
10    11      Amruta Kadam    SY   91.2   13
11    12      Sandeep Mane    SY   68.5   17
12    13      Neha Gaikwad    SY   79.9   17
13    14       Sachin Kale    SY   83.1   15
14    15      Manisha Rane    SY   94.6   15
15    16      Prasad Desai    SY   61.3   14
16    17      Aditi Phadke    SY   77.8   16
17    18      Sameer Tambe    SY   82.0   18
18    19       Reshma Apte    SY   90.4   14
19    20     Kiran Godbole    SY   73.7   16
20    21    Archana Ingale    TY   55.1   13
21    22     Vivek Bhosale    TY   66.9   17
22    23     Sonali Kamble    TY   96.2   17
23    24    Harshal Shelar    TY   71.5   15
24    25   Prachi Deshmukh    TY   48.8   15
25    26      Milind Patil    TY   84.3   14
26    27     Rohini Sawant    TY   59.7   16
27    28   Yogesh Kulkarni    TY   93.0   18
28    29  Supriya Waghmare    TY   67.2   14
29    30      Girish Joshi    TY   75.6   13

In [35]:
df.drop([4,11,23,21,5,16])

    roll              name class  marks  age
0      1   Aditya Kulkarni    FY   85.5   15
1      2     Swapnil Joshi    FY   92.1   16
2      3  Aniket Deshpande    FY   78.3   16
3      4       Gauri Patil    FY   65.8   14
6      7    Shreyas Shinde    FY   95.0   16
7      8      Sneha Jadhav    FY   58.6   14
8      9      Mahesh Pawar    FY   76.4   18
9     10      Priya Chavan    FY   89.7   15
10    11      Amruta Kadam    SY   91.2   13
12    13      Neha Gaikwad    SY   79.9   17
13    14       Sachin Kale    SY   83.1   15
14    15      Manisha Rane    SY   94.6   15
15    16      Prasad Desai    SY   61.3   14
17    18      Sameer Tambe    SY   82.0   18
18    19       Reshma Apte    SY   90.4   14
19    20     Kiran Godbole    SY   73.7   16
20    21    Archana Ingale    TY   55.1   13
22    23     Sonali Kamble    TY   96.2   17
24    25   Prachi Deshmukh    TY   48.8   15
25    26      Milind Patil    TY   84.3   14
26    27     Rohini Sawant    TY   59.7   16
27    28   Yogesh Kulkarni    TY   93.0   18
28    29  Supriya Waghmare    TY   67.2   14
29    30      Girish Joshi    TY   75.6   13

In [36]:
df.drop(range(4,11))

    roll              name class  marks  age
0      1   Aditya Kulkarni    FY   85.5   15
1      2     Swapnil Joshi    FY   92.1   16
2      3  Aniket Deshpande    FY   78.3   16
3      4       Gauri Patil    FY   65.8   14
11    12      Sandeep Mane    SY   68.5   17
12    13      Neha Gaikwad    SY   79.9   17
13    14       Sachin Kale    SY   83.1   15
14    15      Manisha Rane    SY   94.6   15
15    16      Prasad Desai    SY   61.3   14
16    17      Aditi Phadke    SY   77.8   16
17    18      Sameer Tambe    SY   82.0   18
18    19       Reshma Apte    SY   90.4   14
19    20     Kiran Godbole    SY   73.7   16
20    21    Archana Ingale    TY   55.1   13
21    22     Vivek Bhosale    TY   66.9   17
22    23     Sonali Kamble    TY   96.2   17
23    24    Harshal Shelar    TY   71.5   15
24    25   Prachi Deshmukh    TY   48.8   15
25    26      Milind Patil    TY   84.3   14
26    27     Rohini Sawant    TY   59.7   16
27    28   Yogesh Kulkarni    TY   93.0   18
28    29  Supriya Waghmare    TY   67.2   14
29    30      Girish Joshi    TY   75.6   13

In [38]:
df.drop('class', axis = True)

    roll              name  marks  age
0      1   Aditya Kulkarni   85.5   15
1      2     Swapnil Joshi   92.1   16
2      3  Aniket Deshpande   78.3   16
3      4       Gauri Patil   65.8   14
4      5      Rohan Sawant   88.2   17
5      6        Pooja More   72.9   13
6      7    Shreyas Shinde   95.0   16
7      8      Sneha Jadhav   58.6   14
8      9      Mahesh Pawar   76.4   18
9     10      Priya Chavan   89.7   15
10    11      Amruta Kadam   91.2   13
11    12      Sandeep Mane   68.5   17
12    13      Neha Gaikwad   79.9   17
13    14       Sachin Kale   83.1   15
14    15      Manisha Rane   94.6   15
15    16      Prasad Desai   61.3   14
16    17      Aditi Phadke   77.8   16
17    18      Sameer Tambe   82.0   18
18    19       Reshma Apte   90.4   14
19    20     Kiran Godbole   73.7   16
20    21    Archana Ingale   55.1   13
21    22     Vivek Bhosale   66.9   17
22    23     Sonali Kamble   96.2   17
23    24    Harshal Shelar   71.5   15
24    25   Prachi Deshmukh   48.8   15
25    26      Milind Patil   84.3   14
26    27     Rohini Sawant   59.7   16
27    28   Yogesh Kulkarni   93.0   18
28    29  Supriya Waghmare   67.2   14
29    30      Girish Joshi   75.6   13

In [39]:
df.drop(['class','age'], axis = True)

    roll              name  marks
0      1   Aditya Kulkarni   85.5
1      2     Swapnil Joshi   92.1
2      3  Aniket Deshpande   78.3
3      4       Gauri Patil   65.8
4      5      Rohan Sawant   88.2
5      6        Pooja More   72.9
6      7    Shreyas Shinde   95.0
7      8      Sneha Jadhav   58.6
8      9      Mahesh Pawar   76.4
9     10      Priya Chavan   89.7
10    11      Amruta Kadam   91.2
11    12      Sandeep Mane   68.5
12    13      Neha Gaikwad   79.9
13    14       Sachin Kale   83.1
14    15      Manisha Rane   94.6
15    16      Prasad Desai   61.3
16    17      Aditi Phadke   77.8
17    18      Sameer Tambe   82.0
18    19       Reshma Apte   90.4
19    20     Kiran Godbole   73.7
20    21    Archana Ingale   55.1
21    22     Vivek Bhosale   66.9
22    23     Sonali Kamble   96.2
23    24    Harshal Shelar   71.5
24    25   Prachi Deshmukh   48.8
25    26      Milind Patil   84.3
26    27     Rohini Sawant   59.7
27    28   Yogesh Kulkarni   93.0
28    29  Supriya Waghmare   67.2
29    30      Girish Joshi   75.6

#### Numerical Analysis

In [41]:
df['marks'].max()

96.2

In [42]:
df['marks'].min()

48.8

In [43]:
df['marks'].sum()

2323.2999999999997

In [44]:
df['marks'].mean()

77.44333333333333

In [45]:
df['marks'].median()

78.05

In [46]:
df['marks'].std()

13.080827858788767

In [47]:
df.max()

roll                  30
name     Yogesh Kulkarni
class                 TY
marks               96.2
age                   18
dtype: object

In [50]:
df.median(numeric_only=True)

roll     15.50
marks    78.05
age      15.00
dtype: float64

In [51]:
df.sum()

roll                                                   465
name     Aditya KulkarniSwapnil JoshiAniket DeshpandeGa...
class    FYFYFYFYFYFYFYFYFYFYSYSYSYSYSYSYSYSYSYSYTYTYTY...
marks                                               2323.3
age                                                    461
dtype: object

In [53]:
df.sum(axis=True,numeric_only= True)

0     101.5
1     110.1
2      97.3
3      83.8
4     110.2
5      91.9
6     118.0
7      80.6
8     103.4
9     114.7
10    115.2
11     97.5
12    109.9
13    112.1
14    124.6
15     91.3
16    110.8
17    118.0
18    123.4
19    109.7
20     89.1
21    105.9
22    136.2
23    110.5
24     88.8
25    124.3
26    102.7
27    139.0
28    110.2
29    118.6
dtype: float64

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    30 non-null     int64
 1   name    30 non-null     object
 2   class   30 non-null     object
 3   marks   30 non-null     float64
 4   age     30 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 1.3+ KB

In [55]:
df.count()

roll     30
name     30
class    30
marks    30
age      30
dtype: int64

In [56]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [57]:
df.describe()

            roll      marks        age
count  30.000000  30.000000  30.000000
mean   15.500000  77.443333  15.366667
std     8.803408  13.080828   1.564329
min     1.000000  48.800000  13.000000
25%     8.250000  67.525000  14.000000
50%    15.500000  78.050000  15.000000
75%    22.750000  89.325000  16.750000
max    30.000000  96.200000  18.000000

#### Custom Column Operations

In [59]:
subdf = df.head()

In [60]:
subdf

   roll              name class  marks  age
0     1   Aditya Kulkarni    FY   85.5   15
1     2     Swapnil Joshi    FY   92.1   16
2     3  Aniket Deshpande    FY   78.3   16
3     4       Gauri Patil    FY   65.8   14
4     5      Rohan Sawant    FY   88.2   17

In [61]:
subdf['roll'] + 100

0    101
1    102
2    103
3    104
4    105
Name: roll, dtype: int64

In [62]:
subdf['roll'] = subdf['roll'] + 100

/tmp/ipykernel_777438/4184065709.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subdf['roll'] = subdf['roll'] + 100

In [63]:
subdf

   roll              name class  marks  age
0   101   Aditya Kulkarni    FY   85.5   15
1   102     Swapnil Joshi    FY   92.1   16
2   103  Aniket Deshpande    FY   78.3   16
3   104       Gauri Patil    FY   65.8   14
4   105      Rohan Sawant    FY   88.2   17

In [64]:
subdf['cgpa'] = subdf['marks'] / 10 + 0.25

/tmp/ipykernel_777438/3479536787.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subdf['cgpa'] = subdf['marks'] / 10 + 0.25

In [65]:
subdf

   roll              name class  marks  age  cgpa
0   101   Aditya Kulkarni    FY   85.5   15  8.80
1   102     Swapnil Joshi    FY   92.1   16  9.46
2   103  Aniket Deshpande    FY   78.3   16  8.08
3   104       Gauri Patil    FY   65.8   14  6.83
4   105      Rohan Sawant    FY   88.2   17  9.07

In [68]:
subdf['roll'] = range(101,106)

/tmp/ipykernel_777438/1123958675.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subdf['roll'] = range(101,106)

In [69]:
subdf

   roll              name class  marks  age  cgpa
0   101   Aditya Kulkarni    FY   85.5   15  8.80
1   102     Swapnil Joshi    FY   92.1   16  9.46
2   103  Aniket Deshpande    FY   78.3   16  8.08
3   104       Gauri Patil    FY   65.8   14  6.83
4   105      Rohan Sawant    FY   88.2   17  9.07

In [70]:
x = ['M','M','M','F','M']

In [71]:
subdf['gender'] = x
subdf

/tmp/ipykernel_777438/4014481290.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subdf['gender'] = x

   roll              name class  marks  age  cgpa gender
0   101   Aditya Kulkarni    FY   85.5   15  8.80      M
1   102     Swapnil Joshi    FY   92.1   16  9.46      M
2   103  Aniket Deshpande    FY   78.3   16  8.08      M
3   104       Gauri Patil    FY   65.8   14  6.83      F
4   105      Rohan Sawant    FY   88.2   17  9.07      M

#### Connecting dataframes

In [78]:
df1 = pd.read_csv('student-info1.csv', names=['roll','name','class',
                                              'marks','age'])
df2 = pd.read_csv('student-info2.csv')

In [79]:
df1

   roll           name class  marks  age
0    31     Ajit Gawde    FY   68.2   15
1    32  Kavita Shelar    FY   81.9   16
2    33  Sunil Bhosale    SY   74.5   18
3    34  Sarika Kamble    SY   88.0   17
4    35   Nilesh Desai    TY   53.4   18
5    36    Usha Phadke    TY   91.7   19
6    37    Jayant Rane    TY   76.1   18

In [75]:
df2

    roll  gender      city
0      1    Male      Pune
1      2    Male    Mumbai
2      3    Male      Pune
3      4  Female    Nagpur
4      5    Male    Sangli
5      6  Female    Mumbai
6      7    Male    Nashik
7      8  Female      Pune
8      9    Male    Mumbai
9     10  Female      Pune
10    11  Female    Mumbai
11    12    Male      Pune
12    13  Female      Pune
13    14    Male    Nagpur
14    15  Female    Mumbai
15    16    Male      Pune
16    17  Female    Nashik
17    18    Male  Kolhapur
18    19  Female    Mumbai
19    20    Male    Satara
20    21  Female      Pune
21    22    Male    Mumbai
22    23  Female    Nagpur
23    24    Male      Pune
24    25  Female      Pune
25    26    Male  Amravati
26    27  Female    Nashik
27    28    Male      Pune
28    29  Female      Pune
29    30    Male    Nagpur

In [80]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [81]:
df1.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [84]:
dfnew = pd.concat([df, df1], ignore_index=True)

In [85]:
dfnew

    roll              name class  marks  age
0      1   Aditya Kulkarni    FY   85.5   15
1      2     Swapnil Joshi    FY   92.1   16
2      3  Aniket Deshpande    FY   78.3   16
3      4       Gauri Patil    FY   65.8   14
4      5      Rohan Sawant    FY   88.2   17
5      6        Pooja More    FY   72.9   13
6      7    Shreyas Shinde    FY   95.0   16
7      8      Sneha Jadhav    FY   58.6   14
8      9      Mahesh Pawar    FY   76.4   18
9     10      Priya Chavan    FY   89.7   15
10    11      Amruta Kadam    SY   91.2   13
11    12      Sandeep Mane    SY   68.5   17
12    13      Neha Gaikwad    SY   79.9   17
13    14       Sachin Kale    SY   83.1   15
14    15      Manisha Rane    SY   94.6   15
15    16      Prasad Desai    SY   61.3   14
16    17      Aditi Phadke    SY   77.8   16
17    18      Sameer Tambe    SY   82.0   18
18    19       Reshma Apte    SY   90.4   14
19    20     Kiran Godbole    SY   73.7   16
20    21    Archana Ingale    TY   55.1   13
21    22     Vivek Bhosale    TY   66.9   17
22    23     Sonali Kamble    TY   96.2   17
23    24    Harshal Shelar    TY   71.5   15
24    25   Prachi Deshmukh    TY   48.8   15
25    26      Milind Patil    TY   84.3   14
26    27     Rohini Sawant    TY   59.7   16
27    28   Yogesh Kulkarni    TY   93.0   18
28    29  Supriya Waghmare    TY   67.2   14
29    30      Girish Joshi    TY   75.6   13
30    31        Ajit Gawde    FY   68.2   15
31    32     Kavita Shelar    FY   81.9   16
32    33     Sunil Bhosale    SY   74.5   18
33    34     Sarika Kamble    SY   88.0   17
34    35      Nilesh Desai    TY   53.4   18
35    36       Usha Phadke    TY   91.7   19
36    37       Jayant Rane    TY   76.1   18

In [86]:
df2.columns

Index(['roll', 'gender', 'city'], dtype='object')

In [88]:
dfnew = df.merge(df2, on='roll')

In [89]:
dfnew.columns

Index(['roll', 'name', 'class', 'marks', 'age', 'gender', 'city'], dtype='object')

#### Group operations

In [91]:
df['class'].value_counts()

class
FY    10
SY    10
TY    10
Name: count, dtype: int64

In [92]:
df['age'].value_counts()

age
15    6
16    6
14    6
17    5
13    4
18    3
Name: count, dtype: int64

In [93]:
gdf = df.groupby('class')

In [94]:
gdf['marks'].mean()

class
FY    80.25
SY    80.25
TY    71.83
Name: marks, dtype: float64

In [95]:
gdf.get_group('SY')

    roll           name class  marks  age
10    11   Amruta Kadam    SY   91.2   13
11    12   Sandeep Mane    SY   68.5   17
12    13   Neha Gaikwad    SY   79.9   17
13    14    Sachin Kale    SY   83.1   15
14    15   Manisha Rane    SY   94.6   15
15    16   Prasad Desai    SY   61.3   14
16    17   Aditi Phadke    SY   77.8   16
17    18   Sameer Tambe    SY   82.0   18
18    19    Reshma Apte    SY   90.4   14
19    20  Kiran Godbole    SY   73.7   16

In [96]:
gdf.describe()

       roll                                                marks         ...  \
      count  mean      std   min    25%   50%    75%   max count   mean  ...
class                                                                    ...
FY     10.0   5.5  3.02765   1.0   3.25   5.5   7.75  10.0  10.0  80.25  ...
SY     10.0  15.5  3.02765  11.0  13.25  15.5  17.75  20.0  10.0  80.25  ...
TY     10.0  25.5  3.02765  21.0  23.25  25.5  27.75  30.0  10.0  71.83  ...

                      age
          75%   max count  mean       std   min    25%   50%    75%   max
class
FY     89.325  95.0  10.0  15.4  1.505545  13.0  14.25  15.5  16.00  18.0
SY     88.575  94.6  10.0  15.5  1.581139  13.0  14.25  15.5  16.75  18.0
TY     82.125  96.2  10.0  15.2  1.751190  13.0  14.00  15.0  16.75  18.0

[3 rows x 24 columns]

In [97]:
gdf['marks'].max()

class
FY    95.0
SY    94.6
TY    96.2
Name: marks, dtype: float64

#### Boolean Filtering

In [99]:
df['marks'] > 80

0      True
1      True
2     False
3     False
4      True
5     False
6      True
7     False
8     False
9      True
10     True
11    False
12    False
13     True
14     True
15    False
16    False
17     True
18     True
19    False
20    False
21    False
22     True
23    False
24    False
25     True
26    False
27     True
28    False
29    False
Name: marks, dtype: bool

In [101]:
newdf = df[df['marks'] > 80]

In [102]:
newdf

    roll             name class  marks  age
0      1  Aditya Kulkarni    FY   85.5   15
1      2    Swapnil Joshi    FY   92.1   16
4      5     Rohan Sawant    FY   88.2   17
6      7   Shreyas Shinde    FY   95.0   16
9     10     Priya Chavan    FY   89.7   15
10    11     Amruta Kadam    SY   91.2   13
13    14      Sachin Kale    SY   83.1   15
14    15     Manisha Rane    SY   94.6   15
17    18     Sameer Tambe    SY   82.0   18
18    19      Reshma Apte    SY   90.4   14
22    23    Sonali Kamble    TY   96.2   17
25    26     Milind Patil    TY   84.3   14
27    28  Yogesh Kulkarni    TY   93.0   18

In [103]:
newdf = df[(df['marks'] > 80) & (df['class'] == 'SY')]
newdf

    roll          name class  marks  age
10    11  Amruta Kadam    SY   91.2   13
13    14   Sachin Kale    SY   83.1   15
14    15  Manisha Rane    SY   94.6   15
17    18  Sameer Tambe    SY   82.0   18
18    19   Reshma Apte    SY   90.4   14

#### Export the dataframe

In [105]:
newdf.to_csv('output.csv', index=False)